In [1]:
import pandas as pd
import numpy as np

In [2]:
income={
    "Name":['Rob','Rafiq','Nina','sofia','Mohan','Tao','Elon Musk'],
     "Income":[5000,6000,4000,7500,8000,7000,10000000]
}

In [4]:
df=pd.DataFrame(income)
df

        Name    Income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [5]:
df.describe()

             Income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [8]:
df.quantile(0.25,)

C:\Users\hp\AppData\Local\Temp\ipykernel_1832\3656653379.py:1: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.quantile(0.25)

Income    5500.0
Name: 0.25, dtype: float64

In [19]:
percentile_99=df.Income.quantile(0.99)
percentile_99

9400479.999999994

In [20]:
df_no_outlier=df[df.Income<=percentile_99]
df_no_outlier

    Name  Income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  sofia    7500
4  Mohan    8000
5    Tao    7000

In [21]:
df

        Name    Income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [22]:
df['Income'][3]=np.NaN
df

C:\Users\hp\AppData\Local\Temp\ipykernel_1832\985689424.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Income'][3]=np.NaN

        Name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [24]:
df.Income.median()

6500.0

In [25]:
df_new=df.fillna(df.Income.median())
df_new

        Name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0